// Level 7.1 Наподобие задачи Level 4.1.
//    Ваша программа получает массив
//    чисел и отдельное число.
//    Она проходит по нему циклом "forEach" и
//    увеличивает каждый элемент массива
//    на заданное число.
   
//    Пример:
//    var arr = [-3.4, 3.7, 0, 5.6, 0.5], num = 2

//    Console:
//    [-1.4, 5.7, 2, 7.6, 2.5]

//    Пример:
//    var arr = [], num = 3

//    Console:
//    []

//    Пример:
//    var arr = [-8], num = 10

//    Console:
//    [2]
 
//    Пример:
//    var arr = [4.5, 0, 2.8, -15, -12.3], num = -2.8

//    Console:
//    [1.7, -2.8, 0, -17.8, -15.1]

let arr = [-3.4, 3.7, 0, 5.6, 0.5], num = 2;
arr.forEach((e,i) => {
arr[i] = e+num;
});
console.log(arr);